Revit 2027 API
AnalysisDisplayColorSettings.GetIntermediateColors Method
 Get intermediate color entries (other than the minimum and maximum settings).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<AnalysisDisplayColorEntry> GetIntermediateColors()
Public Function GetIntermediateColors As IList(Of AnalysisDisplayColorEntry)
public:
IList<AnalysisDisplayColorEntry^>^ GetIntermediateColors()
member GetIntermediateColors : unit -> IList<AnalysisDisplayColorEntry>
Return Value
IList<AnalysisDisplayColorEntry>
 Array of intermediate color entries.
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace